VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
        case 2:
            // Transition blue → red
            factor1 = 1.0f - ((float)((ind % 60) - 40) / 20.0f);
            factor2 = ((float)((ind % 60) - 40) / 20.0f);
            rr = (uint8_t)(255.0f * factor2);
            gg = 0;
            bb = (uint8_t)(255.0f * factor1);
            break;
    }

    // Store results
    *red = rr;
    *green = gg;
    *blue = bb;
}

// Helper function to map frequency to color temperature (warm to cool)
void frequency_to_color_temp(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    if (freq < 250) {
        // Low frequencies: Warm colors (Red to Orange)
        float ratio = (float)freq / 250.0f;
        *r = 255;
        *g = (uint8_t)(ratio * 165); // Orange component
        *b = 0;
    } else if (freq <= 2000) {
        // Mid frequencies: Yellow to Green
        float ratio = (float)(freq - 250) / 1750.0f;
        *r = (uint8_t)(255 * (1.0f - ratio)); // Fade out red
        *g = 255;
        *b = 0;
    } else {
        // High frequencies: Cool colors (Green to Blue to Violet)
        float ratio = (freq - 2000) / 18000.0f; // Up to 20kHz
        if (ratio > 1.0f) ratio = 1.0f;

        if (ratio < 0.5f) {
            // Green to Blue
            float t = ratio * 2.0f;
            *r = 0;
            *g = (uint8_t)(255 * (1.0f - t));
            *b = (uint8_t)(255 * t);
        } else {
            // Blue to Violet
            float t = (ratio - 0.5f) * 2.0f;
            *r = (uint8_t)(128 * t);
            *g = 0;
            *b = 255;
        }
    }
}

// Helper function to map frequency to full spectrum (Red to Violet)
void frequency_to_full_spectrum(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    // Map frequency to hue (0-300 degrees)
    float hue = (float)freq / 7000.0f * 300.0f; // 0-7kHz mapped to 0-300°
    if (hue > 300.0f) hue = 300.0f;

    HSV_to_RGB(hue, 1.0f, 1.0f, r, g, b);

}

void effect_sound_color() {
    float ratio = (float)amp / amp_maxn;
    if (ratio > 1.0) ratio = 1.0;
    if (ratio <= 0.05f) {
    	Turn_off_all_at_once();
    	WS2812_Send();
    	return;
    }

    int brightness = 5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5));
    Set_Brightness(brightness);

    uint8_t r, g, b;

    if (ratio < 0.5f) {
        float t = ratio / 0.5f;
        r = (uint8_t)(0 + t * (148 - 0));
        g = 0;
        b = (uint8_t)(255 + t * (211 - 255));
    } else {
        float t = (ratio - 0.5f) / 0.5f;
        if (t < 0.5f) {
            float t2 = t / 0.5f;
            r = 255;
            g = (uint8_t)(0 + t2 * (127 - 0));
            b = 0;
        } else {
            float t2 = (t - 0.5f) / 0.5f;
            r = 255;
            g = (uint8_t)(127 + t2 * (255 - 127));
            b = 0;
        }
    }

    for (int i = 0; i < MAX_LED; i++) {
        Set_LED(i, r, g, b);
    }
    WS2812_Send();
}

void ripple_effect(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    int center = MAX_LED / 2;
    int spread = 1 + (int)(ratio * (MAX_LED / 2));

    for (int i = 0; i < MAX_LED; i++) {
        int dist = abs(i - center);
        float brightness = 1.0f - ((float)dist / spread);
        if (brightness < 0.0f) brightness = 0.0f;

        // Get rainbow color based on position
        uint8_t r, g, b;
        get_rainbow_color(i, effStep, &r, &g, &b);

        // Apply brightness modulation to color
        Set_LED(i, (uint8_t)(r * brightness), (uint8_t)(g * brightness), (uint8_t)(b * brightness));
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();

    effStep = (effStep + 1) % 60;
}


void sound_bar_hue_gradient(uint16_t amplitude) {
    static int current_led_count = 1;
    int target_led_count;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    target_led_count = (int)(ratio * MAX_LED);
    if (target_led_count < 1) target_led_count = 1;

    if (amplitude < 100 && current_led_count > 1) {
        current_led_count--;
    } else if (target_led_count > current_led_count) {
        current_led_count++;
    }

    Turn_off_all_at_once();

    for (int i = 0; i < current_led_count; i++) {
        float t = (float)i / (current_led_count - 1);
        float hue = 270.0f * (1.0f - t); // tím (270°) → đỏ (0°)

        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, 1.0f, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();
}

void effect_random_one_in_six_leds_by_sound(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Ignore low amplitude (silence)
    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    Turn_off_all_at_once();

    const int group_size = 6; //per n Led will have 1 random led lighted
    for (int start = 0; start < MAX_LED; start += group_size) {
        int rand_index = rand() % group_size;
        int led_index = start + rand_index;
        if (led_index >= MAX_LED) break;

        // Optional: brighter when louder
        uint8_t brightness = (uint8_t)(ratio * 255);
        uint8_t r = brightness;
        uint8_t g = rand() % brightness;
        uint8_t b = rand() % brightness;

        Set_LED(led_index, r, g, b);
    }

    Set_Brightness(5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5)));
    WS2812_Send();
}

#define AMP_THRESHOLD 1000     // Amplitude threshold to detect a beat
#define FADE_DURATION_MS 500   // Fade duration in milliseconds
void effect_flash_fade_random_color(uint16_t amp, uint16_t peakHz) {
    static uint32_t last_flash_time = 0;  // Time of the last flash

    uint32_t current_time = HAL_GetTick();  // Current time in milliseconds

    // Beat detection: Check if amplitude exceeds threshold
    if (amp > AMP_THRESHOLD) {
        // Generate a random RGB color (0-255)
        uint8_t r = rand() % 256;
        uint8_t g = rand() % 256;
        uint8_t b = rand() % 256;

        // Set all LEDs to the new random color
        for (int i = 0; i < MAX_LED; i++) {
            Set_LED(i, r, g, b);
        }

